src/Documents/ОтчетАвтомата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОтчетАвтомата</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПоказанияСчетчиков</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиВАвтоматах</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиНапитков</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автомат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоматы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыручкаНаличными</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыручкаБезналом</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Продажи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Напиток</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Напитки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказаниеСчетчика</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущееПоказание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ОтчетАвтомата/Forms/ЗаполнитьПоСчетчикам/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПродажиПоказаниеСчетчикаПриИзменении(Элемент)
	ПересчитатьСтрокуИВыручку();
КонецПроцедуры

&НаКлиенте
Процедура ПродажиЦенаПриИзменении(Элемент)
	ПересчитатьСтрокуИВыручку();
КонецПроцедуры

&НаКлиенте
Процедура ВыручкаБезналомПриИзменении(Элемент)
	ПересчитатьВыручку();
КонецПроцедуры

&НаКлиенте
Процедура ПродажиПослеУдаления(Элемент)
	ПересчитатьВыручку();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокуИВыручку()

	Строка = Элементы.Продажи.ТекущиеДанные;
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Строка.Продано = Макс(Строка.ПоказаниеСчетчика - Строка.ПредыдущееПоказание, 0);
	Строка.Сумма   = Строка.Продано * Строка.Цена;

	ПересчитатьВыручку();

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьВыручку()

	Всего = 0;
	Для Каждого Строка Из Объект.Продажи Цикл
		Всего = Всего + Строка.Сумма;
	КонецЦикла;

	Объект.ВыручкаНаличными = Всего - Объект.ВыручкаБезналом;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСчетчикам(Команда)
	ЗаполнитьПоСчетчикамНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоСчетчикамНаСервере()

	Документ = РеквизитФормыВЗначение("Объект");
	Документ.ЗаполнитьПоСчетчикам();
	ЗначениеВРеквизитФормы(Документ, "Объект");

КонецПроцедуры
